# --------------------------------------------------------------------------------------------------------------------#
# ███╗   ███╗ ██████╗ ███████╗██████╗  ██████╗ ██╗  ██╗   ██╗████████╗███████╗ ██████╗██╗  ██╗     █████╗ ██████╗ ██╗ #
# ████╗ ████║██╔═══██╗██╔════╝██╔══██╗██╔═══██╗██║  ╚██╗ ██╔╝╚══██╔══╝██╔════╝██╔════╝██║  ██║    ██╔══██╗██╔══██╗██║ #
# ██╔████╔██║██║   ██║███████╗██████╔╝██║   ██║██║   ╚████╔╝    ██║   █████╗  ██║     ███████║    ███████║██████╔╝██║ #
# ██║╚██╔╝██║██║   ██║╚════██║██╔═══╝ ██║   ██║██║    ╚██╔╝     ██║   ██╔══╝  ██║     ██╔══██║    ██╔══██║██╔═══╝ ██║ #
# ██║ ╚═╝ ██║╚██████╔╝███████║██║     ╚██████╔╝███████╗██║      ██║   ███████╗╚██████╗██║  ██║    ██║  ██║██║     ██║ #
# ╚═╝     ╚═╝ ╚═════╝ ╚══════╝╚═╝      ╚═════╝ ╚══════╝╚═╝      ╚═╝   ╚══════╝ ╚═════╝╚═╝  ╚═╝    ╚═╝  ╚═╝╚═╝     ╚═╝ #
# author: https://t.me/rand0lphc                                                                          version 3.0 #
# ------------------------------------------------------------------------------------------------------------------- #


# class Group:
#     """
#     ...
#     """

#     __EDUCATION_FORMS = {
#         "1": "очная (бакалавриат, специалитет)",
#         "2": "очно-заочная (бакалавриат, специалитет)",
#         "3": "заочная (бакалавриат, специалитет)",
#         "4": "очная (магистратура)",
#         "5": "очно-заочная (магистратура)",
#         "6": "заочная (магистратура)",
#         "7": "заочная (при ускоренном обучении или обучении по индивидуальному учебному плану)",
#         "8": "очно-заочная (при ускоренном обучении или обучении по индивидуальному учебному плану)",
#         "9": "очная (при ускоренном обучении или обучении по индивидуальному учебному плану)",
#         "А": "очная (аспирантура)"
#     }

#     __FACULTY = {
#         "0": "институт издательского дела и журналистики",
#         "1": "транспортный факультет",
#         "2": "факультет машиностроения",
#         "3": "факультет информационных технологий",
#         "4": "факультет урбанистики и городского хозяйства",
#         "5": "факультет химической технологии и биотехнологии",
#         "6": "факультет экономики и управления",
#         "7": "полиграфический институт",
#         "8": "институт графики и искусства книги имени В.А. Фаворского"
#     }

#     CHECK_REQUEST = False

#     def __init__(self, group: str, check_request=CHECK_REQUEST) -> None:
#         """
#         ...
#         """

#         if check_request:
#             pass

#         pass

class Group:
    """
    ...
    """

    def __init__(self) -> None:
        """
        ...
        """

        pass


if __name__ == "__main__":
    pass
